brew "bat"
brew "bats-core"
brew "biome"
brew "diff-so-fancy"
brew "entr"
brew "eslint"
brew "eza"
brew "ffmpeg"
brew "fzf-tab"
brew "gh"
brew "gifsicle"
brew "gnupg"
brew "goreleaser"
brew "hub"
brew "imagemagick"
brew "markdownlint-cli2"
brew "mkcert"
brew "openai-whisper"
brew "pandoc"
brew "pnpm"
brew "prettier"
brew "qpdf"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "thefuck"
brew "tmux"
brew "wget"
brew "yamllint"
brew "yarn"
brew "zlib"

# Homebrew casks
cask "1password-cli"
cask "antigravity"
cask "arc"
cask "chatgpt"
cask "claude"
cask "codex-app"
cask "cursor"
cask "docker-desktop"
cask "elgato-stream-deck"
cask "flux-app"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "hazel"
cask "insta360-link-controller"
cask "karabiner-elements"
cask "keycastr"
cask "libreoffice"
cask "logi-options+"
cask "mutedeck"
cask "notunes"
cask "obsidian"
cask "ollama-app"
cask "raycast"
cask "renamer"
cask "sf-symbols"
cask "shortcutdetective"
cask "shottr"
cask "slack"
cask "spotify"
cask "textbuddy"
cask "visual-studio-code"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-monoid"


