# Homebrew packages (brew)
brew "asdf"
brew "bat"
brew "bats-core"
brew "biome"
brew "diff-so-fancy"
brew "direnv"
brew "entr"
brew "eslint"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "gnupg"
brew "hub"
brew "imagemagick"
brew "markdownlint-cli2"
brew "mas"  # Required for Mac App Store apps
brew "mkcert"
brew "prettier"
brew "pure"
brew "qpdf"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "thefuck"
brew "tmux"
brew "uv"
brew "wget"
brew "yamllint"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh"
brew "zlib"

# Homebrew casks
cask "1password-cli"
cask "arc"
cask "caffeine"
cask "cursor"
cask "docker"
cask "docker-desktop"
cask "elgato-stream-deck"
cask "flux"
cask "flux-app"
cask "google-drive"
cask "hazel"
cask "iterm2"
cask "kitty"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-monoid"
# cask "jordanbaird-ice"  # Disabled: using beta for Tahoe crash fix (see apps/ice/README.md)
cask "karabiner-elements"
cask "keyboard-maestro"
cask "libreoffice"
cask "lm-studio"
cask "ollama-app"
cask "mailmate"
cask "mos"
cask "mutedeck"
cask "obsidian"
cask "raycast"
cask "renamer"
cask "sf-symbols"
cask "shottr"
cask "spotify"
cask "superhuman"
cask "textbuddy"
cask "visual-studio-code"
cask "wezterm"

# Mac App Store apps
mas "Amphetamine", id: 937984704
mas "CARROTweather", id: 993487541
mas "Meeter", id: 1510445899
mas "Rapidmg", id: 6451349778
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696

